/* ********* Ѕиблиотека дл¤ преоюразовани¤ двоичных   **********************
   ********* чисел в двоично-дес¤тичные (bin-bcd)     **********************
   ********* заголовочный файл                        **********************
   ********* Electric Brothers company                **********************
   ********* v2.0                                    **********************
   ********* 2020г.                                   **********************
   *************************************************************************/
#ifndef BIN_BCD_H_INCLUDED
#define BIN_BCD_H_INCLUDED

#ifdef __cplusplus
extern "C" {
#endif

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/*раскоментировать если необходимо гашение незначащих нулей */
//#define OFFZERO
//#define OFFZERO_HUND

//структура результата преобразовани¤ дл¤ 16 и 8 битных чисел
typedef struct
{
  unsigned char units; //переменна¤ дл¤ единиц числа
  unsigned char tens;  //переменна¤ дл¤ дес¤тков числа
  unsigned char hund;  //переменна¤ дл¤ сотен числа
  uint8_t comma;

} bcd8_level_t;

typedef struct
{
  uint8_t units; 	//переменна¤ дл¤ единиц числа
  uint8_t tens;  	//переменна¤ дл¤ дес¤тков числа
  uint8_t hund;  	//переменна¤ дл¤ сотен числа
  uint8_t ths;  	//переменна¤ дл¤ тыс¤ч числа
  uint8_t tn_ths;  //переменна¤ дл¤ дес¤тков тыс¤ч числа
  uint8_t comma;

} bcd16_level_t;

typedef struct
{
  uint8_t units; 	 //переменна¤ дл¤ единиц числа
  uint8_t tens;  	 //переменна¤ дл¤ дес¤тков числа
  uint8_t hund;  	 //переменна¤ дл¤ сотен числа
  uint8_t ths;  	 //переменна¤ дл¤ тыс¤ч числа
  uint8_t tn_ths;    //переменна¤ дл¤ дес¤тков тыс¤ч числа
  uint8_t onh_ths;   //переменна¤ дл¤ сотен тыс¤ч числа
  uint8_t mill;      //переменна¤ дл¤ миллиона числа
  uint8_t th_mill;   //переменна¤ дл¤ дес¤тов миллиона числа
  uint8_t onh_mill;  //переменна¤ дл¤ сотен миллиона числа
  uint8_t bill;      //переменна¤ дл¤ миллиарда числа
  uint8_t comma;

} bcd32_level_t;
//========= ќѕ»—јЌ»≈ ‘”Ќ ÷»… ===============================================
/* --- функци¤:    преобразование двоичного числа в двоично-дес¤тичное
   --- возвращает: структуру с пол¤ми - .дробное,.единицы,.дес¤тки,.сотни
   --- принимает:  двоичное 16 битное число                               */
bcd32_level_t bin32_trans(const uint32_t bin);


//========= ќѕ»—јЌ»≈ ‘”Ќ ÷»… ===============================================
/* --- функци¤:    преобразование двоичного числа в двоично-дес¤тичное
   --- возвращает: структуру с пол¤ми - .дробное,.единицы,.дес¤тки,.сотни
   --- принимает:  двоичное 16 битное число                               */
bcd16_level_t bin16_trans(const uint16_t bin);


//========= ќѕ»—јЌ»≈ ‘”Ќ ÷»… ===============================================
/* --- функци¤:    преобразование двоичного числа в двоично-дес¤тичное
   --- возвращает: структуру с пол¤ми - .дробное,.единицы,.дес¤тки,.сотни
   --- принимает:  двоичное 8 битное число                               */
bcd8_level_t bin8_trans(const uint8_t bin);

#ifdef __cplusplus
}
#endif

#endif //BIN_BCD_H_INCLUDED



